[Survived] ArithmeticOperator
src/app.ts:19:43
 app.use(morgan('dev'));
 app.use(express.json());
 
-const authLimiter = rateLimit({ windowMs: 15 * 60 * 1000, max: 20 });
+const authLimiter = rateLimit({ windowMs: 15 / 60 * 1000, max: 20 });
 const generalLimiter = rateLimit({ windowMs: 15 * 60 * 1000, max: 300 });
 

[Survived] ArithmeticOperator
src/app.ts:19:43
 app.use(morgan('dev'));
 app.use(express.json());
 
-const authLimiter = rateLimit({ windowMs: 15 * 60 * 1000, max: 20 });
+const authLimiter = rateLimit({ windowMs: 15 * 60 / 1000, max: 20 });
 const generalLimiter = rateLimit({ windowMs: 15 * 60 * 1000, max: 300 });
 

[Survived] ArithmeticOperator
src/app.ts:20:46
 app.use(express.json());
 
 const authLimiter = rateLimit({ windowMs: 15 * 60 * 1000, max: 20 });
-const generalLimiter = rateLimit({ windowMs: 15 * 60 * 1000, max: 300 });
+const generalLimiter = rateLimit({ windowMs: 15 * 60 / 1000, max: 300 });
 
 app.use(requireApiVersion);

[Survived] ArithmeticOperator
src/app.ts:20:46
 app.use(express.json());
 
 const authLimiter = rateLimit({ windowMs: 15 * 60 * 1000, max: 20 });
-const generalLimiter = rateLimit({ windowMs: 15 * 60 * 1000, max: 300 });
+const generalLimiter = rateLimit({ windowMs: 15 / 60 * 1000, max: 300 });
 
 app.use(requireApiVersion);

[Survived] StringLiteral
src/app.ts:24:9
 
 app.use(requireApiVersion);
 
-app.use('/auth', authLimiter);
+app.use("", authLimiter);
 app.use('/', generalLimiter);
 

[Killed] BlockStatement
src/app.ts:27:35
 app.use('/auth', authLimiter);
 app.use('/', generalLimiter);
 
-app.get('/health', (_req, res) => {
-  res.json({ status: 'ok' });
-});
+app.get('/health', (_req, res) => {});
 
 // app.use('/auth', authRoutes);
killedBy: GET /health returns 200 with status ok
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/app.ts:34:24
 // app.use('/auth', authRoutes);
 // app.use('/tournaments', tournamentRoutes);
 
-app.use((_req, res) => {
-  res.status(404).json(apiError('NOT_FOUND', 'Route not found'));
-});
+app.use((_req, res) => {});
 
 app.use(errorHandler);
killedBy: 404 handler returns 404 for unknown routes
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
