[Killed] BlockStatement
src/middleware/auth.ts:20:79
   }
 }
 
-export function authenticate(req: Request, res: Response, next: NextFunction) {
-  const header = req.headers.authorization;
-  if (!header?.startsWith('Bearer ')) {
-    return res.status(401).json(apiError('UNAUTHORIZED', 'Missing or malformed token'));
-  }
-
-  const token = header.slice(7);
-  const secret = process.env.JWT_SECRET;
-  if (!secret) throw new Error('JWT_SECRET is not set');
-
-  try {
-    const payload = jwt.verify(token, secret) as JwtPayload;
-    req.user = { id: payload.sub, role: payload.role };
-    next();
-  } catch {
-    return res.status(401).json(apiError('UNAUTHORIZED', 'Invalid or expired token'));
-  }
-}
+export function authenticate(req: Request, res: Response, next: NextFunction) {}
 
 export function requireRole(...roles: Role[]) {
killedBy: authenticate calls next and sets req.user for a valid token
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] MethodExpression
src/middleware/auth.ts:22:8
 
 export function authenticate(req: Request, res: Response, next: NextFunction) {
   const header = req.headers.authorization;
-  if (!header?.startsWith('Bearer ')) {
+  if (!header?.endsWith('Bearer ')) {
     return res.status(401).json(apiError('UNAUTHORIZED', 'Missing or malformed token'));
   }
killedBy: authenticate calls next and sets req.user for a valid token
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] StringLiteral
src/middleware/auth.ts:23:58
 export function authenticate(req: Request, res: Response, next: NextFunction) {
   const header = req.headers.authorization;
   if (!header?.startsWith('Bearer ')) {
-    return res.status(401).json(apiError('UNAUTHORIZED', 'Missing or malformed token'));
+    return res.status(401).json(apiError('UNAUTHORIZED', ""));
   }
 
killedBy: authenticate returns 401 when Authorization header is missing
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] MethodExpression
src/middleware/auth.ts:26:17
     return res.status(401).json(apiError('UNAUTHORIZED', 'Missing or malformed token'));
   }
 
-  const token = header.slice(7);
+  const token = header;
   const secret = process.env.JWT_SECRET;
   if (!secret) throw new Error('JWT_SECRET is not set');
killedBy: authenticate calls next and sets req.user for a valid token
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] StringLiteral
src/middleware/auth.ts:28:32
 
   const token = header.slice(7);
   const secret = process.env.JWT_SECRET;
-  if (!secret) throw new Error('JWT_SECRET is not set');
+  if (!secret) throw new Error("");
 
   try {
killedBy: authenticate throws when JWT_SECRET is not set
statusReason: expected [Function] to throw error including 'JWT_SECRET is not set' but got ''

[Killed] BlockStatement
src/middleware/auth.ts:30:7
   const secret = process.env.JWT_SECRET;
   if (!secret) throw new Error('JWT_SECRET is not set');
 
-  try {
-    const payload = jwt.verify(token, secret) as JwtPayload;
-    req.user = { id: payload.sub, role: payload.role };
-    next();
-  } catch {
+  try {} catch {
     return res.status(401).json(apiError('UNAUTHORIZED', 'Invalid or expired token'));
   }
killedBy: authenticate calls next and sets req.user for a valid token
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/middleware/auth.ts:34:11
     const payload = jwt.verify(token, secret) as JwtPayload;
     req.user = { id: payload.sub, role: payload.role };
     next();
-  } catch {
-    return res.status(401).json(apiError('UNAUTHORIZED', 'Invalid or expired token'));
-  }
+  } catch {}
 }
 
killedBy: authenticate returns 401 for an expired token
statusReason: expected "vi.fn()" to be called with arguments: [ 401 ]

Number of calls: 0

[Survived] StringLiteral
src/middleware/auth.ts:35:42
     req.user = { id: payload.sub, role: payload.role };
     next();
   } catch {
-    return res.status(401).json(apiError('UNAUTHORIZED', 'Invalid or expired token'));
+    return res.status(401).json(apiError("", 'Invalid or expired token'));
   }
 }

[Killed] BlockStatement
src/middleware/auth.ts:40:63
 }
 
 export function requireRole(...roles: Role[]) {
-  return (req: Request, res: Response, next: NextFunction) => {
-    if (!req.user || !roles.includes(req.user.role)) {
-      return res.status(403).json(apiError('FORBIDDEN', 'Insufficient permissions'));
-    }
-    next();
-  };
+  return (req: Request, res: Response, next: NextFunction) => {};
 }
 
killedBy: requireRole calls next when user has a permitted role
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/middleware/auth.ts:41:54
 
 export function requireRole(...roles: Role[]) {
   return (req: Request, res: Response, next: NextFunction) => {
-    if (!req.user || !roles.includes(req.user.role)) {
-      return res.status(403).json(apiError('FORBIDDEN', 'Insufficient permissions'));
-    }
+    if (!req.user || !roles.includes(req.user.role)) {}
     next();
   };
killedBy: requireRole returns 403 when user role is not in the permitted list
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] ConditionalExpression
src/middleware/auth.ts:41:9
 
 export function requireRole(...roles: Role[]) {
   return (req: Request, res: Response, next: NextFunction) => {
-    if (!req.user || !roles.includes(req.user.role)) {
+    if (true) {
       return res.status(403).json(apiError('FORBIDDEN', 'Insufficient permissions'));
     }
killedBy: requireRole calls next when user has a permitted role
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] StringLiteral
src/middleware/auth.ts:42:44
 export function requireRole(...roles: Role[]) {
   return (req: Request, res: Response, next: NextFunction) => {
     if (!req.user || !roles.includes(req.user.role)) {
-      return res.status(403).json(apiError('FORBIDDEN', 'Insufficient permissions'));
+      return res.status(403).json(apiError("", 'Insufficient permissions'));
     }
     next();
killedBy: requireRole returns 403 when user role is not in the permitted list
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {
