[Killed] BlockStatement
src/middleware/errorHandler.ts:4:91
 import { Request, Response, NextFunction } from 'express';
 import { apiError } from '../lib/errors';
 
-export function errorHandler(err: Error, req: Request, res: Response, next: NextFunction) {
-    console.error(err);
-
-    res.status(500).json(apiError('INTERNAL_ERROR', 'Something went wrong'));
-}
+export function errorHandler(err: Error, req: Request, res: Response, next: NextFunction) {}
killedBy: errorHandler logs the error to console.error
statusReason: expected "error" to be called with arguments: [ Error: boom ]

Number of calls: 0
