[Killed] BlockStatement
src/middleware/apiVersion.ts:4:84
 import { Request, Response, NextFunction } from 'express';
 import { apiError } from '../lib/errors';
 
-export function requireApiVersion(req: Request, res: Response, next: NextFunction) {
-  const version = req.headers['x-api-version'] ?? '1';
-  if (version !== '1') {
-    return res.status(400).json(apiError('UNSUPPORTED_VERSION', 'x-api-version header must be "1"'));
-  }
-  next();
-}
+export function requireApiVersion(req: Request, res: Response, next: NextFunction) {}
 
killedBy: GET /health returns 200 with status ok
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/middleware/apiVersion.ts:5:19
 import { apiError } from '../lib/errors';
 
 export function requireApiVersion(req: Request, res: Response, next: NextFunction) {
-  const version = req.headers['x-api-version'] ?? '1';
+  const version = req.headers['x-api-version'] && '1';
   if (version !== '1') {
     return res.status(400).json(apiError('UNSUPPORTED_VERSION', 'x-api-version header must be "1"'));
killedBy: apiVersion middleware integration rejects requests with unsupported x-api-version before hitting routes
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BlockStatement
src/middleware/apiVersion.ts:6:24
 
 export function requireApiVersion(req: Request, res: Response, next: NextFunction) {
   const version = req.headers['x-api-version'] ?? '1';
-  if (version !== '1') {
-    return res.status(400).json(apiError('UNSUPPORTED_VERSION', 'x-api-version header must be "1"'));
-  }
+  if (version !== '1') {}
   next();
 }
killedBy: apiVersion middleware integration rejects requests with unsupported x-api-version before hitting routes
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/middleware/apiVersion.ts:6:7
 
 export function requireApiVersion(req: Request, res: Response, next: NextFunction) {
   const version = req.headers['x-api-version'] ?? '1';
-  if (version !== '1') {
+  if (false) {
     return res.status(400).json(apiError('UNSUPPORTED_VERSION', 'x-api-version header must be "1"'));
   }
killedBy: apiVersion middleware integration rejects requests with unsupported x-api-version before hitting routes
statusReason: expected 200 to be 400 // Object.is equality
