[Killed] BlockStatement
src/lib/errors.ts:1:76
-export function apiError(code: string, message: string, details?: unknown) {
-    return { error: { code, message, details } };
-}
+export function apiError(code: string, message: string, details?: unknown) {}
killedBy: 404 handler returns NOT_FOUND error code
statusReason: Cannot read properties of undefined (reading 'code')
